Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Control Library (Microsoft Docs) contains links to each of the Windows common controls (however, only a few of these use WM_COMMAND).
ja: コントロールライブラリ (Microsoft Docs)には、Windowsのコモンコントロールへのリンクが含まれています（ただし、WM_COMMANDを使用するものはごく一部です）。

source: Control Library (Microsoft Docs) contains links to each of the Windows common controls.
ja: コントロールライブラリ (Microsoft Docs)には、Windows共通の各コントロールへのリンクが含まれています。

source: Control Library (Microsoft Docs) contains links to each of the the Windows common controls (however, only a few of these use WM_COMMAND).
ja: コントロールライブラリ（Microsoft Docs）には、Windows共通の各コントロールへのリンクが含まれています（ただし、WM_COMMANDを使用するものはごく一部です）。

source: Control Library (Microsoft Docs) contains links to each of the the Windows common controls.
ja: コントロールライブラリ（Microsoft Docs）には、Windows共通の各コントロールへのリンクが含まれています。

source: Control functions, SetWinDelay, SetKeyDelay, SetMouseDelay
ja: Control関数、SetWinDelay、SetKeyDelay、SetMouseDelay

source: ControlAddItem, ControlDeleteItem, Control functions
ja: ControlAddItem、ControlDeleteItem、Control関数

source: ControlAddItem, ControlFindItem, Delete method (GuiControl object), Control functions
ja: ControlAddItem、ControlFindItem、Deleteメソッド（GuiControlオブジェクト）、Control関数

source: ControlChooseIndex allows 0 to deselect the current item/all items.
ja: ControlChooseIndexは、0 で現在のアイテム/すべてのアイテムの選択を解除することができます。

source: ControlChooseIndex, ControlChooseString, Value property (GuiControl object), Choose method (GuiControl object), Control functions
ja: ControlChooseIndex、ControlChooseString、Valueプロパティ（GuiControlオブジェクト）、Chooseメソッド（GuiControlオブジェクト）、Control関数

source: ControlChooseIndex, ControlGetChoice, Choose method (GuiControl object), Control functions
ja: ControlChooseIndex、ControlChooseString、Chooseメソッド（GuiControlオブジェクト）、Control関数

source: ControlChooseIndex, ControlGetChoice, ControlChooseString, Value property (GuiControl object), Choose method (GuiControl object), Control functions
ja: ControlChooseIndex、ControlGetChoice、ControlChooseString、Valueプロパティ（GuiControlオブジェクト）、Chooseメソッド（GuiControlオブジェクト）、Control関数

source: ControlDeleteItem, ControlFindItem, Add method (GuiControl object), Control functions
ja: ControlDeleteItem、ControlFindItem、Addメソッド（GuiControlオブジェクト）、Control関数

source: ControlFocus, Control functions
ja: ControlFocus、Control関数

source: ControlGetChecked, Value property (GuiControl object), Control functions
ja: ControlGetChecked、Valueプロパティ（GuiControlオブジェクト）、Control関数

source: ControlGetClassNN returns the ClassNN of the specified control.
ja: ControlGetClassNNは、指定されたコントロールの ClassNN を返します。

source: ControlGetEnabled, WinSetEnabled, Enabled property (GuiControl object), Control functions
ja: ControlGetEnabled、WinSetEnabled、Enabledプロパティ（GuiControlオブジェクト）、Control関数

source: ControlGetFocus now returns the control's HWND instead of its ClassNN, and no longer considers there to be an error when it has successfully determined that the window has no focused control.
ja: ControlGetFocusは、ClassNNの代わりにコントロールのHWNDを返すようになり、ウィンドウにフォーカスされたコントロールがないことを正常に判断した場合、エラーがあると見なされなくなりました。

source: ControlGetIndex, ControlChooseString, Choose method (GuiControl object), Control functions
ja: ControlGetIndex、ControlChooseString、Chooseメソッド（GuiControlオブジェクト）、Control関数

source: ControlGetItems replaces "ControlGet List" for ListBox and ComboBox.
ja: ControlGetItemsは、ListBoxとComboBoxの「ControlGet List」に代わるものです。

source: ControlGetItems, WinGetList, Control functions
ja: ControlGetItems、WinGetList、Control関数

source: ControlGetPos, WinMove, SetControlDelay, Control functions
ja: ControlGetPos、WinMove、SetControlDelay、Control関数

source: ControlGetStyle / ControlGetExStyle, WinSetStyle / WinSetExStyle, styles table, Control functions
ja: ControlGetStyle / ControlGetExStyle、WinSetStyle / WinSetExStyle、スタイル表、Control関数

source: ControlHide, ControlGetVisible, WinShow, Visible property (GuiControl object), Control functions
ja: ControlHide、ControlGetVisible、WinShow、Visibleプロパティ（GuiControlオブジェクト）、Control関数

source: ControlHide, ControlShow, Visible property (GuiControl object), Control functions
ja: ControlHide、ControlShow、Visibleプロパティ（GuiControlオブジェクト）、Control関数

source: ControlHideDropDown, Control functions
ja: ControlHideDropDown、Control関数

source: ControlMove, ControlGetPos and ControlClick now use client coordinates (like GuiControl) instead of window coordinates.
ja: ControlMove、ControlGetPos、ControlClickで、ウィンドウ座標の代わりにクライアント座標（GuiControlのような）を使用するようになりました。

source: ControlMove, ControlSend and ControlSetText now use parameter order consistent with the other Control functions; i.e. Control, WinTitle, WinText, ExcludeTitle, ExcludeText are always grouped together (at the end of the parameter list), to aide memorisation.
ja: ControlMove、ControlSend、ControlSetTextは、他のControl関数と同様にパラメータの順序を使用するようになりました。つまり、Control、WinTitle、WinText、ExcludeTitle、ExcludeTextは、常に一緒に（パラメータリストの最後に）まとめられ、記憶しやすくなっています。

source: ControlMove, WinGetPos, Control functions
ja: ControlMove、WinGetPos、Control関数

source: ControlMove, WinGetPos, WinHide, WinMinimize, WinMaximize, Win functions
ja: ControlMove、WinGetPos、WinHide、WinMinimize、WinMaximize、Win関数

source: ControlSend is not affected; it uses SetKeyDelay.
ja: ControlSend関数は影響を受けません。これはSetKeyDelayを使用します。

source: ControlSendText, equivalent to ControlSendRaw but using Text mode instead of Raw mode.
ja: ControlSendTextは。ControlSendRawと同等ですが、Rawモードの代わりにTextモードを使用します。

source: ControlSendText, equivalent to ControlSendRaw but using {Text} mode instead of {Raw} mode.
ja: ControlSendTextは。ControlSendRawと同等ですが、{Raw}モードの代わりに{Text}モードを使用します。

source: ControlSetChecked, ControlSetEnabled, Pause, Suspend, WinSetAlwaysOnTop, and WinSetEnabled allow 1, 0 and -1.
ja: ControlSetChecked、ControlSetEnabled、Pause、Suspend、WinSetAlwaysOnTop、WinSetEnabledでは、1、0、-1が可能です。

source: ControlSetChecked, Value property (GuiControl object), Control functions
ja: ControlSetChecked、Valueプロパティ（GuiControlオブジェクト）、Control関数

source: ControlSetEnabled, Win functions, Control functions
ja: ControlSetEnabled、Win関数、Control関数

source: ControlSetEnabled, WinSetEnabled, Enabled property (GuiControl object), Control functions
ja: ControlSetEnabled、WinSetEnabled、Enabledプロパティ（GuiControlオブジェクト）、Control関数

source: ControlSetStyle / ControlSetExStyle, WinGetStyle / WinGetExStyle, styles table, Control functions
ja: ControlSetStyle / ControlSetExStyle、WinGetStyle / WinGetExStyle、スタイル表、Control関数

source: ControlSetText, Control functions
ja: ControlSetText、Control関数

source: ControlSetText, WinGetText, Control functions
ja: ControlSetText、WinGetText、Control関数

source: ControlShow, ControlGetVisible, WinHide, Visible property (GuiControl object), Control functions
ja: ControlShow、ControlGetVisible、WinHide、Visibleプロパティ（GuiControlオブジェクト）、Control関数

source: ControlShowDropDown, Control functions
ja: ControlShowDropDown、Control関数

source: Controller remapping:
ja: コントローラーのリマッピング：

source: Controller remapping: Methods of sending keystrokes and mouse clicks with a controller.
ja: コントローラーのリマッピング：コントローラでキーストロークやマウスクリックを送信する方法。

source: Controller-To-Mouse script:
ja: Controller-To-Mouseのスクリプト：

source: Controller-To-Mouse script: Using a controller as a mouse.
ja: Controller-To-Mouseのスクリプト：コントローラーをマウスとして使う。

source: Convert a Script to an EXE (Ahk2Exe):
ja: スクリプトをEXEに変換する(Ahk2Exe)：

source: Convert a Script to an EXE (Ahk2Exe): Convert a .ahk script into a .exe file that can run on any PC.
ja: スクリプトをEXEに変換する(Ahk2Exe)：.ahkスクリプトをどのPCでも実行できる.exeファイルに変換します。

source: CoordMode defaults to Client (added in v1.1.05) instead of Window.
ja: CoordModeのデフォルトがWindowではなくClient（v1.1.05で追加）になっている。

source: CoordMode no longer accepts "Relative" as a mode, since all modes are relative to something.
ja: すべてのモードは何かに対して相対的であるため、CoordModeはモードとして「Relative」を受け付けなくなりました。

source: CoordMode, Win functions, SetDefaultMouseSpeed, Click
ja: CoordMode、Win関数、SetDefaultMouseSpeed、Click

source: Cos: Returns the trigonometric cosine of a number.
ja: Cos：Cosine関数は、数値の三角コサインを返します。

source: Count is now a property.
ja: Countがプロパティになりました。

source: Count: Retrieves the number of key-value pairs present in a map.
ja: Count：マップに存在するキーとバリューのペアの数を取得します。

source: Critical "Off" ; Even if Critical "On" was never used.
ja: Critical"Off" ; Critical "On"が一度も使われなかったとしても。

source: Critical, Threads, Hotkey, Menu object, SetTimer, Process functions
ja: Critical、スレッド、Hotkey、Menuオブジェクト、SetTimer、Process関数

source: Custom Objects - Creating a Base Object, Classes, Construction and Destruction, Meta-Functions
ja: カスタムオブジェクト：ベースオブジェクトの作成、クラス、コンストラクタとデストラクタ、メタファンクション

source: DPI scaling is enabled by default for script GUIs to ensure they scale according to the system DPI setting.
ja: スクリプトGUIでは、DPIスケーリングがデフォルトで有効になっており、システムのDPI設定に応じたスケーリングが行われるようになっています。

source: Debug: Shows directive debugging text.
ja: Debug：ディレクティブのデバッグテキストを表示する。

source: Debugging a Script:
ja: スクリプトのデバッグ：

source: Debugging a Script: How to find the flaws in a misbehaving script.
ja: スクリプトのデバッグ：誤動作するスクリプトの欠陥を見つける方法。

source: Default: Defines the default value returned when a key is not found.
ja: Default：キーが見つからない場合に返されるデフォルト値を定義します。

source: Default: Defines the default value returned when an element with no value is requested.
ja: Default：値のない要素が要求されたときに返されるデフォルト値を定義します。

source: Default: Retrieves or sets the default menu item.
ja: Default：デフォルトのメニュー項目を取得または設定します。

source: DefineProp can be used to define what happens when a specific property is retrieved, set or called, without having to define any meta-functions.
ja: DefinePropは、メタファンクションを定義することなく、特定のプロパティの取得、設定、または呼び出し時の動作を定義するために使用することができます。

source: DefineProp: Defines a new own property.
ja: DefineProp：新しい自身のプロパティを定義する。

source: Delete can only delete one key at a time.
ja: Deleteは、一度に1つのキーしか削除できません。

source: Delete: Deletes the specified item or all items.
ja: Delete：指定された項目またはすべての項目を削除します。

source: Delete: Deletes the specified row or all rows.
ja: Delete：指定された行またはすべての行を削除する。

source: Delete: Removes a key-value pair from a map.
ja: Delete：マップからキーとバリューのペアを削除します。

source: Delete: Removes the value of an array element, leaving the index without a value.
ja: Delete：配列の要素の値を削除し、インデックスに値を残さないようにします。

source: DeleteCol: Deletes the specified column and all of the contents beneath it.
ja: DeleteCol：指定された列とその下にあるすべてのコンテンツを削除する。

source: DeleteProp: Removes an own property from an object.
ja: DeleteProp：オブジェクトから自身のプロパティを削除する。

source: Deluxe Clipboard: Provides unlimited number of private, named clipboards to Copy, Cut, Paste, Append or CutAppend of selected text.
ja: Deluxe Clipboard：選択したテキストをコピー、カット、ペースト、アペンド、カットアペンドするためのプライベートな名前付きクリップボードを無制限に提供することができます。

source: Destroy: Deletes the window.
ja: Destroy：ウィンドウを削除します。

source: DetectHiddenWindows affects whether the ahk_id criterion detects hidden top-level windows, but hidden controls are always detected.
ja: DetectHiddenWindowsは、ahk_id基準が非表示のトップレベルウィンドウを検出するかどうかに影響するが、非表示のコントロールは常に検出される。

source: DetectHiddenWindows also affects whether hidden windows identified by HWND are detected, but only when used with WinWait or WinWaitClose.
ja: DetectHiddenWindows関数もHWNDで識別される非表示ウィンドウが検出されるかどうかに影響しますが、WinWait関数またはWinWaitClose関数と併用したときに限られます。

source: DirCopy, FileCopy, FileMove, FileDelete, file loops, DirSelect, SplitPath
ja: DirCopy、FileCopy、FileMove、FileDelete、ファイルループ、DirSelect、SplitPath

source: DirDelete, unless Recurse is false
ja: Recurseが false でない限り、DirDelete

source: DirExist, FileGetAttrib, file loops
ja: DirExist、FileGetAttrib、ファイルループ

source: DirMove, FileCopy, FileMove, FileDelete, file loops, DirSelect, SplitPath
ja: DirMove、FileCopy、FileMove、FileDelete、ファイルループ、DirSelect、SplitPath

source: DirMove, unless the R option is used
ja: DirMove、Rオプションが使われていない場合

source: DirSelect, MsgBox, InputBox, ToolTip, GUI, CLSID List, parsing loop, SplitPath
ja: DirSelect、MsgBox、InputBox、ToolTip、GUI、CLSIDリスト、解析ループ、SplitPath

source: Directives that control executable metadata:
ja: 実行メタデータを制御するディレクティブ：

source: Directives that control the script behaviour:
ja: スクリプトの動作を制御するディレクティブ：

source: DllCall (for DllFile and Function)
ja: DllCall（DllFileおよびFunction用）

source: DllCall("SetCursorPos", "int", 100, "int", 400) ; The first number is the X-coordinate and the second is the Y (relative to the screen).
ja: DllCall("SetCursorPos", "int", 100, "int", 400) ; 最初の数字はX座標、2番目の数字はY（画面からの相対座標）です。

source: DllCall, OnMessage, OnExit, OnClipboardChange, Sort's callback, Critical, PostMessage, SendMessage, Functions, Windows Messages, Threads
ja: DllCall、OnMessage、OnExit、OnClipboardChange、Sortのコールバック、Critical、PostMessage、SendMessage、関数、Windowsメッセージ、スレッド

source: DllCall, Win functions, Monitor functions
ja: DllCall、Win関数、Monitor関数

source: DllCall, Win functions, SysGet
ja: DllCall、Win関数、SysGet

source: DllCall: See DllCall section further below.
ja: DllCall：後述のDllCallの項を参照。

source: Double-derefs are now more consistent with variables resolved at load-time, and are no longer capable of creating new variables.
ja: ダブルデフがロード時に解決される変数との整合性が高くなり、新しい変数を作成することができなくなりました。

source: DriveEject and DriveRetract now use DeviceIoControl instead of mciSendString.
ja: DriveEjectとDriveRetractが mciSendString の代わりに DeviceIoControl を使用するようになりました。

source: DriveEject, Drive functions
ja: DriveEject、Drive関数

source: DriveGetCapacity, Drive functions
ja: DriveGetCapacity、Drive関数

source: DriveGetLabel, Drive functions
ja: DriveGetLabel、Drive関数

source: DriveGetSpaceFree, Drive functions
ja: DriveGetSpaceFree、Drive関数

source: DriveGetStatusCD, Drive functions
ja: DriveGetStatusCD、Drive関数

source: DriveLock, Drive functions
ja: DriveLock、Drive関数

source: DriveSetLabel and DriveGet variants (except DriveGetType)
ja: DriveSetLabelおよびDriveGet のバリエーション(DriveGetTypeを除く)

source: DriveSetLabel, Drive functions
ja: DriveSetLabel、Drive関数

source: DriveUnlock, Drive functions
ja: DriveUnlock、Drive関数

source: Edit now does nothing if the script was read from stdin, instead of attempting to open an editor for *.
ja: Editは、スクリプトがstdinから読み込まれた場合、*のためのエディタを開こうとするのではなく、何もしないようになりました。

source: Edit previously had fallback behaviour for the .ini file type if the "edit" shell verb was not registered.
ja: Editは、シェル動詞「edit」が登録されていない場合、.iniファイルタイプに対してフォールバック動作をしていました。

source: EditGetCurrentCol, EditGetCurrentLine, EditGetLine, EditGetSelectedText, EditPaste, Control functions
ja: EditGetCurrentCol、EditGetCurrentLine、EditGetLine、EditGetSelectedText、EditPaste、Control関数

source: EditGetCurrentCol, EditGetCurrentLine, EditGetLineCount, EditGetLine, EditPaste, Control functions
ja: EditGetCurrentCol、EditGetCurrentLine、EditGetLineCount、EditGetLine、EditPaste、Control関数

source: EditGetCurrentCol, EditGetCurrentLine, EditGetLineCount, EditGetSelectedText, EditPaste, Control functions
ja: EditGetCurrentCol、EditGetCurrentLine、EditGetLineCount、EditGetSelectedText、EditPaste、Control関数

source: EditGetCurrentCol, EditGetLineCount, EditGetLine, EditGetSelectedText, EditPaste, Control functions
ja: EditGetCurrentCol、EditGetLineCount、EditGetLine、EditGetSelectedText、EditPaste、Control関数

source: EditGetCurrentLine, EditGetLineCount, EditGetLine, EditGetSelectedText, EditPaste, Control functions
ja: EditGetCurrentLine、EditGetLineCount、EditGetLine、EditGetSelectedText、EditPaste、Control関数

source: Else, Try and Finally allow any valid statement to their right, as they require a body but have no parameters.
ja: Else、Try、および、Finallyは、本体を必要とするがパラメータを持たないため、その右側に任意の有効な文を置くことができる。

source: Else, when used after a catch statement, executes only if no exception is thrown within a try statement.
ja: Elseは、catch文の後に使用すると、try文の中で例外が発生しなかった場合にのみ実行されます。

source: Encoding: Retrieves or sets the text encoding used by this file object.
ja: Encoding：このファイルオブジェクトが使用するテキストエンコーディングを取得または設定します。

source: EndKey: Returns the name of the end key which was pressed to terminate the Input.
ja: EndKey：Input を終了させるために押された終了キーの名前を返します。

source: EndMods: Returns a string of the modifiers which were logically down when Input was terminated.
ja: EndMods：Input終了時に論理的にダウンしていたモディファイアの文字列を返します。

source: EndReason: Returns an EndReason string indicating how Input was terminated.
ja: EndReason：Input がどのように終了したかを示すEndReason の文字列を返す。

source: Enumerator object, OwnProps, While-loop, Loop, Until, Break, Continue, Blocks
ja: Enumeratorオブジェクト、OwnProps、Whileループ、Loop、Until、Break、Continue、ブロック

source: EnvSet now deletes the environment variable if the Value parameter is completely omitted.
ja: EnvSetで、Valueパラメータが完全に省略された場合、環境変数を削除するようになりました。

source: EnvSet now deletes the environment variable if the value parameter is completely omitted.
ja: EnvSetで、valueパラメータが完全に省略された場合、環境変数を削除するようになりました。

source: Error Object, Try, Catch, Finally, OnError
ja: Errorオブジェクト、Try、Catch、Finally、OnError

source: Error or OSError:
ja: Error または OSError：

source: Error or OSError: There was a problem carring out the function's purpose, such as retrieving a setting or applying a change.
ja: Error または OSError：設定値の取得や変更の適用など、機能の目的を遂行する上で問題があった。

source: Error: The function was called but it aborted with a fatal exception.
ja: Error：関数は呼び出されましたが、致命的な例外が発生して異常終了しました。

source: Error: The function was called but was passed too many or too few arguments.
ja: Error：関数を呼び出したが、渡された引数が多すぎたり少なすぎたりした。

source: Error: The specified DllFile could not be accessed or loaded.
ja: Error：指定されたDllFileは、アクセスまたはロードできませんでした。

source: Error: The specified function could not be found inside the DLL.
ja: Error：指定された関数はDLL内に見つかりませんでした。

source: Escape sequences can be used to denote special characters.
ja: エスケープシーケンスは、特殊文字を表すために使用することができます。

source: Escape sequences such as `n (linefeed) and `t (tab) are supported inside the continuation section except when the accent (`) option has been specified.
ja: `n（改行）や `t（タブ）などのエスケープシーケンスは、アクセント（`）オプションが指定されている場合を除き、継続セクションの内部でサポートされています。

source: Example #1 on the WinGetStyle page can be used to determine whether a window is disabled.
ja: WinGetStyleページの例1は、ウィンドウが無効かどうかを判断するために使用できます。

source: Exception.Extra contains KeyName.
ja: Exception.Extraに KeyNameが含まれています。

source: ExeName: Specifies the location and name for the .exe.
ja: ExeName：.exeの場所と名前を指定します。

source: Exit previously acted as ExitApp when the script is not persistent, even if there were other suspended threads interrupted by the thread which called Exit.
ja: Exitは、これまで、スクリプトが永続的でない場合、Exitを呼び出したスレッドによって中断された他のスレッドがあったとしても、ExitAppとして動作していました。

source: ExitApp, OnExit, Functions, Return, Threads, Persistent
ja: ExitApp、OnExit、関数、Return、スレッド、Persistent

source: Exp: Returns the result of raising e to the Nth power.
ja: Exp：eをN乗した結果を返します。

source: Expressions are not currently supported within the replacement text.
ja: 現在、置換テキスト内の式はサポートされていません。

source: Expressions, Ternary operator (a?b:c), Blocks, Else, While-loop
ja: 式、三項演算子（a?b:c）、ブロック、Else、Whileループ

source: Extended Usage - Arrays of Arrays
ja: 延長使用：配列の配列

source: Fat arrow syntax can be used to define a property getter or setter which returns an expression:
ja: ファット・アロー構文を使用すると、式を返すプロパティ・ゲッターまたはセッターを定義できます：

source: Fat arrow syntax can be used to define a single-line method which returns an expression:
ja: ファット・アロー構文は、式を返す単一行のメソッドを定義するために使用できます：

source: File objects now strictly require property syntax when invoking properties and method syntax when invoking methods.
ja: Fileオブジェクトは、プロパティを呼び出す場合はプロパティ構文、メソッドを呼び出す場合はメソッド構文が厳密に要求されるようになりました。

source: File.RawRead: When a variable is passed directly, the address of the variable's internal string buffer is no longer used.
ja: File.RawRead：変数を直接渡す場合、その変数の内部文字列バッファのアドレスは使用されなくなります。

source: File.RawWrite: As above, except that it can accept a string (or variable containing a string), in which case Bytes defaults to the size of the string in bytes.
ja: File.RawWrite：ただし、文字列（または文字列を含む変数）を受け取ることができ、その場合、Bytesは文字列のサイズ（バイト）をデフォルトとします。

source: File.ReadLine always supports `n, `r`n and `r as line endings and does not include them in its return value, regardless of whether the `r or `n options are used.
ja: File.ReadLineは、`n、`r`n、`rを常に行末としてサポートし、`rまたは`nオプションが使用されているかどうかにかかわらず、その戻り値にそれらを含めないようにします。

source: File.ReadLine now always supports `r, `n and `r`n as line endings, and no longer includes the line ending in the return value.
ja: File.ReadLineが常に行末として`r、`n、`r`nをサポートするようになり、行末を戻り値に含めないようになりました。

source: FileAppend (because it can also send text to stderr or stdout)
ja: FileAppend（標準エラーまたは標準アウトにテキストを送信することもできるため）

source: FileAppend defaults to no end-of-line translations, consistent with FileRead and FileOpen.
ja: FileAppendは、FileReadおよびFileOpenと同様に、行末の変換を行わないことをデフォルトとしています。

source: FileAppend, continuation sections
ja: FileAppend、継続セクション

source: FileCopy and FileMove now throw an exception if the source path does not contain * or ? and no file was not found.
ja: FileCopyとFileMoveで、コピー元のパスに*または?がなく、ファイルが見つからなかった場合に例外が発生するようになりました。

source: FileEncoding controls the default encoding of files read or written by the script, while IniRead and IniWrite always deal in UTF-16 or ANSI.
ja: FileEncodingは、スクリプトが読み書きするファイルのデフォルトエンコーディングを制御し、IniReadと IniWriteは常にUTF-16またはANSIで処理する。

source: FileEncoding now allows code pages to be specified by number without the CP prefix.
ja: FileEncodingで、コードページをCPプレフィックスなしで番号で指定できるようになりました。

source: FileEncoding, File Object, FileRead
ja: FileEncoding、Fileオブジェクト、FileRead

source: FileEncoding, FileOpen/File Object, FileRead, FileAppend, Sort, Loop, Break, Continue, Blocks, FileSetAttrib, FileSetTime
ja: FileEncoding、FileOpen/Fileオブジェクト、FileRead、FileAppend、Sort、Loop、Break、Continue、ブロック、FileSetAttrib、FileSetTime

source: FileEncoding, FileOpen/File Object, FileRead, file-reading loop, IniWrite, FileDelete, OutputDebug, continuation sections
ja: FileEncoding、FileOpen/Fileオブジェクト、FileRead、ファイル読み込みループ、IniWrite、FileDelete、OutputDebug、継続セクション

source: FileEncoding, FileOpen/File Object, file-reading loop, FileGetSize, FileAppend, IniRead, Sort, Download
ja: FileEncoding、FileOpen/Fileオブジェクト、ファイル読み込みループ、FileGetSize、FileAppend、IniRead、Sort、Download

source: FileExist now ignores the . and .. implied in every directory listing, so FileExist("dir\*") is now false instead of true when dir exists but is empty.
ja: FileExistは、すべてのディレクトリリストに含まれる.と..を無視するようになったので、dirが存在するが空である場合、FileExist("dir\*")は真ではなく偽になりました。

source: FileExist, DirExist, FileSetAttrib, FileGetTime, FileSetTime, FileGetSize, FileGetVersion, file loop
ja: FileExist、DirExist、FileSetAttrib、FileGetTime、FileSetTime、FileGetSize、FileGetVersion、ファイルループ

source: FileExist, FileGetAttrib, file loops
ja: FileExist、FileGetAttrib、ファイルループ

source: FileGetAttrib and A_LoopFileAttrib now include the letter "L" for reparse points or symbolic links.
ja: FileGetAttribとA_LoopFileAttribに、リパースポイントやシンボリックリンクを表す「L」の文字が含まれるようになりました。

source: FileGetAttrib, FileGetTime, FileSetTime, FileGetSize, FileGetVersion, file loop
ja: FileGetAttrib、FileGetTime、FileSetTime、FileGetSize、FileGetVersion、ファイルループ

source: FileGetAttrib, FileSetAttrib, FileGetTime, FileSetTime, FileGetSize, file loop
ja: FileGetAttrib、FileSetAttrib、FileGetTime、FileSetTime、FileGetSize、ファイルループ

source: FileGetAttrib, FileSetAttrib, FileGetTime, FileSetTime, FileGetVersion, file loop
ja: FileGetAttrib、FileSetAttrib、FileGetTime、FileSetTime、FileGetVersion、ファイルループ

source: FileGetTime, FileGetAttrib, FileSetAttrib, FileGetSize, FileGetVersion, FormatTime, file loop, DateAdd, DateDiff
ja: FileGetTime、FileGetAttrib、FileSetAttrib、FileGetSize、FileGetVersion、FormatTime、ファイルループ、DateAdd、DateDiff

source: FileInstall in a non-compiled script no longer attempts to copy the file if source and destination are the same path (after resolving relative paths, as the source is relative to A_ScriptDir, not A_WorkingDir).
ja: コンパイルされていないスクリプトの FileInstall は、コピー元とコピー先が同じパスの場合、ファイルをコピーしようとしなくなりました（相対パスを解決した後、コピー元が A_WorkingDir ではなく A_ScriptDir への相対パスになっていたため）。
